Revit 2027 API
PrinterResolution Enumeration
 Controls the resolution level in rendering settings.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public enum PrinterResolution
Public Enumeration PrinterResolution
public enum class PrinterResolution
type PrinterResolution
Members
Member name | Value | Description
High | 2 |  High printer resolution.
Low | 0 |  Low printer resolution.
Medium | 1 |  Medium printer resolution.
VeryHigh | 3 |  VeryHigh printer resolution.
Remarks
 It is applicable only when using printer resolution. The suitable resolution value for each resolution level is decided by default in Revit.
See Also
Reference
Autodesk.Revit.DB Namespace